yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostlux385.h
#define MASK_MSC_CFGP24_INT_LEV  0x01
#define MASK_MSC_CFGP24_INT_SEL0 0x02
#define MASK_MSC_CFGP24_INT_SEL1 0x04
#define MASK_MSC_CFGP24_INT_ENB  0x08
#define MASK_MSC_CFGP24_INT_TYPE 0x10

#define MASK_MSC_CFGP25_INT_LEV  0x01
#define MASK_MSC_CFGP25_INT_SEL0 0x02
#define MASK_MSC_CFGP25_INT_SEL1 0x04
#define MASK_MSC_CFGP25_INT_ENB  0x08
#define MASK_MSC_CFGP25_INT_TYPE 0x10

#define MASK_MSC_STSP0_BIT_0_INT 0x01
#define MASK_MSC_STSP0_BIT_1_INT 0x02
#define MASK_MSC_STSP0_BIT_2_INT 0x04
#define MASK_MSC_STSP0_BIT_3_INT 0x08
#define MASK_MSC_STSP0_BIT_4_INT 0x10
#define MASK_MSC_STSP0_BIT_5_INT 0x20

#define MASK_MSC_STSP2_BIT_0_INT 0x01
#define MASK_MSC_STSP2_BIT_1_INT 0x02
#define MASK_MSC_STSP2_BIT_2_INT 0x04
#define MASK_MSC_STSP2_BIT_3_INT 0x08
#define MASK_MSC_STSP2_BIT_4_INT 0x10
#define MASK_MSC_STSP2_BIT_5_INT 0x20

#define MASK_MSC_INPP2_DATA_IN   0x3F

#define MASK_MSC_DACCTR_DAC0_EN  0x01
#define MASK_MSC_DACCTR_DAC1_EN  0x02
#define MASK_MSC_DACCTR_DAC2_EN  0x04
#define MASK_MSC_DACCTR_DAC3_EN  0x08
#define MASK_MSC_DACCTR_CP3_EN   0x10
#define MASK_MSC_DACCTR_CP3_SEL  0x20
#define MASK_MSC_DACCTR_DACBIAS_EN 0x80

#define MASK_MSC_DACIN0_DAC_IN0  0x0F

#define MASK_MSC_DACIN1_DAC_IN1  0x0F

#define MASK_MSC_DACIN2_DAC_IN2  0x0F

#define MASK_MSC_DACIN3_DAC_IN3  0x0F

#define MASK_MSC_SMDCFG01_SMED0_GLBCONF 0x0F
#define MASK_MSC_SMDCFG01_SMED1_GLBCONF 0xF0

#define MASK_MSC_SMDCFG23_SMED2_GLBCONF 0x0F
#define MASK_MSC_SMDCFG23_SMED3_GLBCONF 0xF0

#define MASK_MSC_SMDCFG45_SMED4_GLBCONF 0x0F
#define MASK_MSC_SMDCFG45_SMED5_GLBCONF 0xF0

#define MASK_MSC_SMSWEV_SW0      0x01
#define MASK_MSC_SMSWEV_SW1      0x02
#define MASK_MSC_SMSWEV_SW2      0x04
#define MASK_MSC_SMSWEV_SW3      0x08
#define MASK_MSC_SMSWEV_SW4      0x10
#define MASK_MSC_SMSWEV_SW5      0x20

#define MASK_MSC_SMULOCK_USE_UNLOCK_01 0x01
#define MASK_MSC_SMULOCK_USE_UNLOCK_23 0x02
#define MASK_MSC_SMULOCK_USE_UNLOCK_45 0x04
#define MASK_MSC_SMULOCK_UNLOCK_01 0x08
#define MASK_MSC_SMULOCK_UNLOCK_23 0x10
#define MASK_MSC_SMULOCK_UNLOCK_45 0x20

#define MASK_MSC_CBOXS0_CONB_S0_00 0x01
#define MASK_MSC_CBOXS0_CONB_S0_01 0x02
#define MASK_MSC_CBOXS0_CONB_S0_10 0x04
#define MASK_MSC_CBOXS0_CONB_S0_11 0x08
#define MASK_MSC_CBOXS0_CONB_S0_20 0x10
#define MASK_MSC_CBOXS0_CONB_S0_21 0x20

#define MASK_MSC_CBOXS1_CONB_S1_00 0x01
#define MASK_MSC_CBOXS1_CONB_S1_01 0x02
#define MASK_MSC_CBOXS1_CONB_S1_10 0x04
#define MASK_MSC_CBOXS1_CONB_S1_11 0x08
#define MASK_MSC_CBOXS1_CONB_S1_20 0x10
#define MASK_MSC_CBOXS1_CONB_S1_21 0x20

#define MASK_MSC_CBOXS2_CONB_S2_00 0x01
#define MASK_MSC_CBOXS2_CONB_S2_01 0x02
#define MASK_MSC_CBOXS2_CONB_S2_10 0x04
#define MASK_MSC_CBOXS2_CONB_S2_11 0x08
#define MASK_MSC_CBOXS2_CONB_S2_20 0x10
#define MASK_MSC_CBOXS2_CONB_S2_21 0x20

#define MASK_MSC_CBOXS3_CONB_S3_00 0x01
#define MASK_MSC_CBOXS3_CONB_S3_01 0x02
#define MASK_MSC_CBOXS3_CONB_S3_10 0x04
#define MASK_MSC_CBOXS3_CONB_S3_11 0x08
#define MASK_MSC_CBOXS3_CONB_S3_20 0x10
#define MASK_MSC_CBOXS3_CONB_S3_21 0x20

#define MASK_MSC_CBOXS4_CONB_S4_00 0x01
#define MASK_MSC_CBOXS4_CONB_S4_01 0x02
#define MASK_MSC_CBOXS4_CONB_S4_10 0x04
#define MASK_MSC_CBOXS4_CONB_S4_11 0x08
#define MASK_MSC_CBOXS4_CONB_S4_20 0x10
#define MASK_MSC_CBOXS4_CONB_S4_21 0x20

#define MASK_MSC_CBOXS5_CONB_S5_00 0x01
#define MASK_MSC_CBOXS5_CONB_S5_01 0x02
#define MASK_MSC_CBOXS5_CONB_S5_10 0x04
#define MASK_MSC_CBOXS5_CONB_S5_11 0x08
#define MASK_MSC_CBOXS5_CONB_S5_20 0x10
#define MASK_MSC_CBOXS5_CONB_S5_21 0x20

#define MASK_MSC_IOMXSMD_SMD_FSML0 0x07
#define MASK_MSC_IOMXSMD_SEL_FSMEN0 0x08
#define MASK_MSC_IOMXSMD_SMD_FSML1 0x70
#define MASK_MSC_IOMXSMD_SEL_FSMEN1 0x80

#define MASK_MSC_INPP3_COMP0     0x01
#define MASK_MSC_INPP3_COMP1     0x02
#define MASK_MSC_INPP3_COMP2     0x04
#define MASK_MSC_INPP3_COMP3     0x08

#define MASK_MSC_IOMXP0_SEL_P010 0x03
#define MASK_MSC_IOMXP0_SEL_P032 0x0C
#define MASK_MSC_IOMXP0_SEL_P054 0x30

#define MASK_MSC_IOMXP1_SEL_P10  0x01
#define MASK_MSC_IOMXP1_SEL_P11  0x02
#define MASK_MSC_IOMXP1_SEL_P12  0x04
#define MASK_MSC_IOMXP1_SEL_P13  0x08
#define MASK_MSC_IOMXP1_SEL_P14  0x10
#define MASK_MSC_IOMXP1_SEL_P15  0x20


/*-------------------------------------------------------------------------
 *      Flash Registers register definitions
 *-----------------------------------------------------------------------*/
/* Flash control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char FIX         : 1;
  unsigned char IE          : 1;
  unsigned char AHALT       : 1;
  unsigned char HALT        : 1;
} __BITS_FLASH_CR1;
#endif
__IO_REG8_BIT(FLASH_CR1,   0x505A, __READ_WRITE, __BITS_FLASH_CR1);

/* Flash control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PRG         : 1;
  unsigned char             : 3;
  unsigned char FPRG        : 1;
  unsigned char ERASE       : 1;
  unsigned char WWO         : 1;
  unsigned char OPT         : 1;
} __BITS_FLASH_CR2;
#endif
__IO_REG8_BIT(FLASH_CR2,   0x505B, __READ_WRITE, __BITS_FLASH_CR2);

/* Flash complementary control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NPRG        : 1;
  unsigned char             : 3;
  unsigned char NFPRG       : 1;
  unsigned char NERASE      : 1;
  unsigned char NWWO        : 1;
  unsigned char NOPT        : 1;
} __BITS_FLASH_NCR2;
#endif
__IO_REG8_BIT(FLASH_NCR2,  0x505C, __READ_WRITE, __BITS_FLASH_NCR2);

/* Flash protection register */
__IO_REG8    (FLASH_FPR,   0x505D, __READ);
/* Flash complementary protection register */
__IO_REG8    (FLASH_NFPR,  0x505E, __READ);
/* Flash status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char WR_PG_DIS   : 1;
  unsigned char PUL         : 1;
  unsigned char EOP         : 1;
  unsigned char DUL         : 1;
  unsigned char             : 2;
  unsigned char HVOFF       : 1;
} __BITS_FLASH_IAPSR;
#endif
__IO_REG8_BIT(FLASH_IAPSR, 0x505F, __READ_WRITE, __BITS_FLASH_IAPSR);

/* Flash program memory unprotection register */
__IO_REG8    (FLASH_PUKR,  0x5062, __READ_WRITE);
/* Flash data unprotection register */
__IO_REG8    (FLASH_DUKR,  0x5064, __READ_WRITE);
/* Flash wait state register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char Wait        : 2;
} __BITS_FLASH_WAIT;
#endif
__IO_REG8_BIT(FLASH_WAIT,  0x5067, __READ, __BITS_FLASH_WAIT);


/*-------------------------------------------------------------------------
 *      Flash Registers bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define FLASH_CR1_FIX            FLASH_CR1_bit.FIX
#define FLASH_CR1_IE             FLASH_CR1_bit.IE
#define FLASH_CR1_AHALT          FLASH_CR1_bit.AHALT
#define FLASH_CR1_HALT           FLASH_CR1_bit.HALT

#define FLASH_CR2_PRG            FLASH_CR2_bit.PRG
#define FLASH_CR2_FPRG           FLASH_CR2_bit.FPRG
#define FLASH_CR2_ERASE          FLASH_CR2_bit.ERASE
#define FLASH_CR2_WWO            FLASH_CR2_bit.WWO
#define FLASH_CR2_OPT            FLASH_CR2_bit.OPT

#define FLASH_NCR2_NPRG          FLASH_NCR2_bit.NPRG
#define FLASH_NCR2_NFPRG         FLASH_NCR2_bit.NFPRG
#define FLASH_NCR2_NERASE        FLASH_NCR2_bit.NERASE
#define FLASH_NCR2_NWWO          FLASH_NCR2_bit.NWWO
#define FLASH_NCR2_NOPT          FLASH_NCR2_bit.NOPT

#define FLASH_IAPSR_WR_PG_DIS    FLASH_IAPSR_bit.WR_PG_DIS
#define FLASH_IAPSR_PUL          FLASH_IAPSR_bit.PUL
#define FLASH_IAPSR_EOP          FLASH_IAPSR_bit.EOP
#define FLASH_IAPSR_DUL          FLASH_IAPSR_bit.DUL
#define FLASH_IAPSR_HVOFF        FLASH_IAPSR_bit.HVOFF

